sysbench/output_64/cacheline64/oltp-update-non-index.out
sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 1 tps: 178.72 qps: 178.72 (r/w/o: 0.00/178.72/0.00) lat (ms,95%): 8.58 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 1 tps: 160.61 qps: 160.61 (r/w/o: 0.00/160.61/0.00) lat (ms,95%): 11.04 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 1 tps: 172.40 qps: 172.40 (r/w/o: 0.00/172.40/0.00) lat (ms,95%): 9.06 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 1 tps: 162.00 qps: 162.00 (r/w/o: 0.00/162.00/0.00) lat (ms,95%): 10.27 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 1 tps: 168.40 qps: 168.40 (r/w/o: 0.00/168.40/0.00) lat (ms,95%): 9.73 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 1 tps: 169.80 qps: 169.80 (r/w/o: 0.00/169.80/0.00) lat (ms,95%): 9.56 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 1 tps: 170.40 qps: 170.40 (r/w/o: 0.00/170.40/0.00) lat (ms,95%): 9.56 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 1 tps: 185.21 qps: 185.21 (r/w/o: 0.00/185.21/0.00) lat (ms,95%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 1 tps: 173.80 qps: 173.80 (r/w/o: 0.00/173.80/0.00) lat (ms,95%): 9.06 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 1 tps: 164.40 qps: 164.40 (r/w/o: 0.00/164.40/0.00) lat (ms,95%): 10.09 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 1 tps: 160.20 qps: 160.20 (r/w/o: 0.00/160.20/0.00) lat (ms,95%): 10.09 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 1 tps: 162.60 qps: 162.60 (r/w/o: 0.00/162.60/0.00) lat (ms,95%): 10.46 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           10144
        other:                           0
        total:                           10144
    transactions:                        10144  (169.05 per sec.)
    queries:                             10144  (169.05 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      169.0494
    time elapsed:                        60.0061s
    total number of events:              10144

Latency (ms):
         min:                                    2.80
         avg:                                    5.91
         max:                                   80.18
         95th percentile:                        9.73
         sum:                                59990.20

Threads fairness:
    events (avg/stddev):           10144.0000/0.00
    execution time (avg/stddev):   59.9902/0.00

sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 2
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 2 tps: 324.66 qps: 324.66 (r/w/o: 0.00/324.66/0.00) lat (ms,95%): 10.09 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 2 tps: 310.22 qps: 310.22 (r/w/o: 0.00/310.22/0.00) lat (ms,95%): 10.27 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 2 tps: 308.79 qps: 308.79 (r/w/o: 0.00/308.79/0.00) lat (ms,95%): 10.84 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 2 tps: 329.81 qps: 329.81 (r/w/o: 0.00/329.81/0.00) lat (ms,95%): 9.56 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 2 tps: 320.20 qps: 320.20 (r/w/o: 0.00/320.20/0.00) lat (ms,95%): 9.91 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 2 tps: 347.40 qps: 347.40 (r/w/o: 0.00/347.40/0.00) lat (ms,95%): 9.56 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 2 tps: 332.39 qps: 332.39 (r/w/o: 0.00/332.39/0.00) lat (ms,95%): 9.39 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 2 tps: 311.20 qps: 311.20 (r/w/o: 0.00/311.20/0.00) lat (ms,95%): 9.56 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 2 tps: 340.40 qps: 340.40 (r/w/o: 0.00/340.40/0.00) lat (ms,95%): 8.90 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 2 tps: 327.40 qps: 327.40 (r/w/o: 0.00/327.40/0.00) lat (ms,95%): 10.09 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 2 tps: 334.79 qps: 334.79 (r/w/o: 0.00/334.79/0.00) lat (ms,95%): 9.91 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 2 tps: 328.21 qps: 328.21 (r/w/o: 0.00/328.21/0.00) lat (ms,95%): 10.27 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           19580
        other:                           0
        total:                           19580
    transactions:                        19580  (326.27 per sec.)
    queries:                             19580  (326.27 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      326.2664
    time elapsed:                        60.0123s
    total number of events:              19580

Latency (ms):
         min:                                    2.72
         avg:                                    6.13
         max:                                  210.82
         95th percentile:                        9.91
         sum:                               119991.46

Threads fairness:
    events (avg/stddev):           9790.0000/16.00
    execution time (avg/stddev):   59.9957/0.00

sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 4 tps: 587.57 qps: 587.57 (r/w/o: 0.00/587.57/0.00) lat (ms,95%): 11.24 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 4 tps: 609.83 qps: 609.83 (r/w/o: 0.00/609.83/0.00) lat (ms,95%): 11.04 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 4 tps: 526.00 qps: 526.00 (r/w/o: 0.00/526.00/0.00) lat (ms,95%): 12.30 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 582.39 qps: 582.39 (r/w/o: 0.00/582.39/0.00) lat (ms,95%): 11.45 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 4 tps: 598.59 qps: 598.59 (r/w/o: 0.00/598.59/0.00) lat (ms,95%): 11.04 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 576.81 qps: 576.81 (r/w/o: 0.00/576.81/0.00) lat (ms,95%): 11.45 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 4 tps: 598.41 qps: 598.41 (r/w/o: 0.00/598.41/0.00) lat (ms,95%): 10.84 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 583.99 qps: 583.99 (r/w/o: 0.00/583.99/0.00) lat (ms,95%): 11.24 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 4 tps: 602.81 qps: 602.81 (r/w/o: 0.00/602.81/0.00) lat (ms,95%): 11.24 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 585.20 qps: 585.20 (r/w/o: 0.00/585.20/0.00) lat (ms,95%): 10.84 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 4 tps: 573.59 qps: 573.59 (r/w/o: 0.00/573.59/0.00) lat (ms,95%): 10.65 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 591.60 qps: 591.60 (r/w/o: 0.00/591.60/0.00) lat (ms,95%): 10.46 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           35087
        other:                           0
        total:                           35087
    transactions:                        35087  (584.73 per sec.)
    queries:                             35087  (584.73 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      584.7274
    time elapsed:                        60.0057s
    total number of events:              35087

Latency (ms):
         min:                                    2.75
         avg:                                    6.84
         max:                                  295.33
         95th percentile:                       11.24
         sum:                               239955.18

Threads fairness:
    events (avg/stddev):           8771.7500/25.34
    execution time (avg/stddev):   59.9888/0.00

sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 8 tps: 1027.51 qps: 1027.51 (r/w/o: 0.00/1027.51/0.00) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 8 tps: 1061.22 qps: 1061.22 (r/w/o: 0.00/1061.22/0.00) lat (ms,95%): 12.30 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 8 tps: 1050.11 qps: 1050.11 (r/w/o: 0.00/1050.11/0.00) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 997.25 qps: 997.25 (r/w/o: 0.00/997.25/0.00) lat (ms,95%): 12.75 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 8 tps: 986.02 qps: 986.02 (r/w/o: 0.00/986.02/0.00) lat (ms,95%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 1086.80 qps: 1086.80 (r/w/o: 0.00/1086.80/0.00) lat (ms,95%): 12.08 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 8 tps: 1102.80 qps: 1102.80 (r/w/o: 0.00/1102.80/0.00) lat (ms,95%): 11.24 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 911.61 qps: 911.61 (r/w/o: 0.00/911.61/0.00) lat (ms,95%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 8 tps: 1076.34 qps: 1076.34 (r/w/o: 0.00/1076.34/0.00) lat (ms,95%): 11.65 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 1057.83 qps: 1057.83 (r/w/o: 0.00/1057.83/0.00) lat (ms,95%): 12.52 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 8 tps: 1080.82 qps: 1080.82 (r/w/o: 0.00/1080.82/0.00) lat (ms,95%): 12.08 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 1007.37 qps: 1007.37 (r/w/o: 0.00/1007.37/0.00) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           62238
        other:                           0
        total:                           62238
    transactions:                        62238  (1037.11 per sec.)
    queries:                             62238  (1037.11 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      1037.1116
    time elapsed:                        60.0109s
    total number of events:              62238

Latency (ms):
         min:                                    3.04
         avg:                                    7.71
         max:                                  166.33
         95th percentile:                       12.52
         sum:                               479964.01

Threads fairness:
    events (avg/stddev):           7779.7500/15.70
    execution time (avg/stddev):   59.9955/0.00

sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 16 tps: 1918.21 qps: 1918.21 (r/w/o: 0.00/1918.21/0.00) lat (ms,95%): 12.52 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 16 tps: 1808.83 qps: 1808.83 (r/w/o: 0.00/1808.83/0.00) lat (ms,95%): 14.46 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 16 tps: 1911.82 qps: 1911.82 (r/w/o: 0.00/1911.82/0.00) lat (ms,95%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 1926.58 qps: 1926.58 (r/w/o: 0.00/1926.58/0.00) lat (ms,95%): 12.52 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 16 tps: 1911.02 qps: 1911.02 (r/w/o: 0.00/1911.02/0.00) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 2004.00 qps: 2004.00 (r/w/o: 0.00/2004.00/0.00) lat (ms,95%): 12.52 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 16 tps: 1867.18 qps: 1867.18 (r/w/o: 0.00/1867.18/0.00) lat (ms,95%): 13.22 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 1915.60 qps: 1915.60 (r/w/o: 0.00/1915.60/0.00) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 16 tps: 1946.01 qps: 1946.01 (r/w/o: 0.00/1946.01/0.00) lat (ms,95%): 12.08 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 1942.62 qps: 1942.62 (r/w/o: 0.00/1942.62/0.00) lat (ms,95%): 12.30 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 16 tps: 1829.20 qps: 1829.20 (r/w/o: 0.00/1829.20/0.00) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 1992.58 qps: 1992.58 (r/w/o: 0.00/1992.58/0.00) lat (ms,95%): 12.52 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           114889
        other:                           0
        total:                           114889
    transactions:                        114889 (1914.22 per sec.)
    queries:                             114889 (1914.22 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      1914.2155
    time elapsed:                        60.0188s
    total number of events:              114889

Latency (ms):
         min:                                    3.05
         avg:                                    8.36
         max:                                  459.54
         95th percentile:                       12.98
         sum:                               960068.50

Threads fairness:
    events (avg/stddev):           7180.5625/16.46
    execution time (avg/stddev):   60.0043/0.01

sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 32 tps: 3438.65 qps: 3438.65 (r/w/o: 0.00/3438.65/0.00) lat (ms,95%): 14.46 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 32 tps: 3317.66 qps: 3317.66 (r/w/o: 0.00/3317.66/0.00) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 32 tps: 3264.44 qps: 3264.44 (r/w/o: 0.00/3264.44/0.00) lat (ms,95%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 32 tps: 3441.49 qps: 3441.49 (r/w/o: 0.00/3441.49/0.00) lat (ms,95%): 14.46 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 32 tps: 3245.26 qps: 3245.26 (r/w/o: 0.00/3245.26/0.00) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 32 tps: 3406.67 qps: 3406.67 (r/w/o: 0.00/3406.67/0.00) lat (ms,95%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 32 tps: 3506.36 qps: 3506.36 (r/w/o: 0.00/3506.36/0.00) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 32 tps: 3520.18 qps: 3520.18 (r/w/o: 0.00/3520.18/0.00) lat (ms,95%): 13.95 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 32 tps: 3192.25 qps: 3192.25 (r/w/o: 0.00/3192.25/0.00) lat (ms,95%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 32 tps: 3511.74 qps: 3511.74 (r/w/o: 0.00/3511.74/0.00) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 32 tps: 3462.00 qps: 3462.00 (r/w/o: 0.00/3462.00/0.00) lat (ms,95%): 14.46 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 32 tps: 3498.19 qps: 3498.19 (r/w/o: 0.00/3498.19/0.00) lat (ms,95%): 13.70 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           204063
        other:                           0
        total:                           204063
    transactions:                        204063 (3400.53 per sec.)
    queries:                             204063 (3400.53 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      3400.5333
    time elapsed:                        60.0091s
    total number of events:              204063

Latency (ms):
         min:                                    3.06
         avg:                                    9.41
         max:                                  213.41
         95th percentile:                       14.46
         sum:                              1919844.85

Threads fairness:
    events (avg/stddev):           6376.9688/21.44
    execution time (avg/stddev):   59.9952/0.00